11/data/attachments/8e5a9ebff8ef8758.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_4ec86680-0f92-46e3-bcfb-16e9b8c56b92</nif:username>
            <nif:friendToBeAdded>Anthony_science_Friend_16961_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>